Tekla Open API Reference for Tekla Structures 2025
AnalysisModelGeneralProperties.MemberAxisLocationEnum Enumeration
 Defines the member axis location.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum MemberAxisLocationEnum
Public Enumeration MemberAxisLocationEnum
Members
Member name | Value | Description
MODEL_DEFAULT | 0 |  The member axis is defined individually based on each part's properties.
REFERENCE_AXIS_ECCENTRICITY_BY_NEUTRAL_AXIS | 1 |  The reference axis is the member axis. The location of the neutral axis defines the axis eccentricity.
REFERENCE_AXIS | 2 |  The reference axis is the member axis.
NEUTRAL_AXIS | 3 |  The neutral axis is the member axis.
See Also
Reference
Tekla.Structures.Analysis Namespace